Repository: IsaacHuo/MyLeafy
Catalog: leafy/Localizable.xcstrings
Source language: zh_hans
Languages: en_us

source: 当前教学楼目录暂时无法按楼层拆分。
en_us: The current teaching building directory cannot be split by floor temporarily.

source: 当前条件下没有可用教室
en_us: No available classrooms under the current conditions

source: 当前条件尚未更新，下方仍显示上次成功更新的数据。
en_us: Current conditions have not been updated, the data below still shows the last successful update.

source: 当前校园身份下保存在本机的随记
en_us: Notes saved on this device for the current campus identity

source: 当前没有合适的目的地，可以稍后再试。
en_us: No suitable destination currently, please try again later.

source: 当前没有未通过课程
en_us: There are currently no failed courses

source: 当前版本
en_us: Current version

source: 当前状态
en_us: Current status

source: 当前社区身份不可用，草稿尚未保存。请继续编辑或放弃更改。
en_us: Current community identity is unavailable, draft has not been saved. Please continue editing or discard changes.

source: 当前社区身份不可用，草稿未能删除。
en_us: Current community identity is unavailable, draft could not be deleted.

source: 当前缓存没有解析到学校官方 GPA，因此 GPA 暂不展示。
en_us: Current cache did not parse the school's official GPA, so GPA is temporarily not displayed.

source: 当前网络无法连接教务验证码。网络恢复后会自动重试，也可点验证码区域重试。
en_us: Current network cannot connect to the academic verification code. It will automatically retry once the network is restored, or you can click the verification code area to retry.

source: 当前网络无法连接研究生系统验证码。网络恢复后会自动重试，也可点验证码区域重试。
en_us: Current network cannot connect to the graduate system verification code. It will automatically retry once the network is restored, or you can click the verification code area to retry.

source: 当前近 30 天
en_us: Last 30 days

source: 当前页面未解析到学校官方 GPA，因此 GPA 暂不显示。
en_us: The current page did not parse the school's official GPA, so GPA is temporarily not displayed.

source: 当前颜色
en_us: Current color

source: 当天无课
en_us: No classes that day

source: 当天没有课程安排
en_us: No classes scheduled for the day

source: 录音备注
en_us: Recording notes

source: 录音随记
en_us: Recording memo

source: 待保存文件
en_us: Files to be saved

source: 待办
en_us: To-do

source: 待办事项
en_us: To-do items

source: 待同步
en_us: To be synchronized

source: 待审核
en_us: Pending review

source: 总学分
en_us: Total credits

source: 总目标 %arg 次
en_us: Total targets %arg times

source: 总目标 %lld 次
en_us: Total goal %lld times

source: 总费用
en_us: Total cost

source: 总随记
en_us: Total notes

source: 恢复
en_us: Restore

source: 情景助手
en_us: Scenario assistant

source: 成绩
en_us: Grades

source: 成绩 %d 条
en_us: %d grades

source: 成绩 CSV 模板
en_us: Grade CSV template

source: 成绩，例如 92、优秀或合格
en_us: Grades, e.g., 92, Excellent, or Pass

source: 成绩估算
en_us: Grade estimate

source: 成绩保存失败
en_us: Grades could not be saved

source: 成绩保存失败：%@
en_us: Unable to save grades: %@

source: 成绩分析
en_us: Grade analysis

source: 成绩失败
en_us: Grade failed

source: 成绩失败：%@
en_us: Grades failed: %@

source: 成绩支持数字或文字等级；课程类型可以留空，保存后显示为“未分类”。
en_us: Grades support numeric or letter levels; course type can be left blank, will show as "Uncategorized" after saving.

source: 成绩详情
en_us: Grade details

source: 我发起的
en_us: Initiated by me

source: 我同意社区条约
en_us: I agree to the community covenant

source: 我已阅读并同意社区条款
en_us: I have read and agree to the community terms

source: 我投过的
en_us: I voted on

source: 我的
en_us: Me

source: 我的共享
en_us: My shares

source: 我的发帖
en_us: My posts

source: 我的投票
en_us: My votes

source: 我的收藏
en_us: My favorites

source: 我的更多作品
en_us: My other works

source: 我的点赞
en_us: My likes

source: 我的评分
en_us: My ratings

source: 我的评论
en_us: My comments

source: 截止于 %@
en_us: As of %@

source: 截止日
en_us: Deadline

source: 截止日期
en_us: Due date

source: 截止时间
en_us: Deadline time

source: 截至今天
en_us: As of today

source: 所有这门课
en_us: All in this course

source: 手动添加成绩
en_us: Manually add grades

source: 手动添加或导入考试后，会显示在考试安排和课表考试提示中。
en_us: After manually adding or importing exams, they will be displayed in the exam schedule and class schedule exam prompts.

source: 手动补录一两门课时更快。
en_us: Manually add one or two courses faster.

source: 打开 %@ -> 我的 -> 共享课表，点击“添加同学的课表”并粘贴邀请码。
en_us: Open %@ -> Mine -> Shared Schedule, click 'Add class schedule of a classmate' and paste the invitation code.

source: 打开 GPA、分数分布和课程影响分析
en_us: Open GPA, grade distribution, and course impact analysis

source: 打开完整照片图库
en_us: Open full photo gallery

source: 打开并继续编辑草稿
en_us: Open and continue editing draft

source: 打开日迹记录菜单
en_us: Open Daytrace records menu

source: 打开社区资料编辑页面
en_us: Open community profile edit page

source: 打开缓存与同步，重新拉取最新课表。
en_us: Open cache and sync, then pull the latest schedule again.

source: 打开草稿箱
en_us: Open draft box

source: 打开这位同学的共享课表
en_us: Open this student’s shared class schedule

source: 打开链接
en_us: Open link

source: 打开随记详情
en_us: Open the note details

source: 批量导入课表
en_us: Batch import class schedules

source: 投票
en_us: Vote

source: 投票中
en_us: Voting open

source: 投票前需要先同意社区条款。
en_us: You need to agree to the community terms before voting.

source: 投票前需要先完善社区资料。
en_us: You need to complete your community profile before voting.

source: 投票加载超时，请检查网络后重试。
en_us: Voting load timed out, please check the network and try again.

source: 投票后可见
en_us: Visible after voting

source: 投票已提交审核。
en_us: Your vote has been submitted for review.

source: 投票类型
en_us: Vote type

source: 投稿
en_us: Submit contribution

source: 报销台账
en_us: Reimbursement ledger

source: 拍照
en_us: Take photo

source: 拖动或缩放头像，保留方框中的部分。
en_us: Drag or zoom the avatar, keeping the part within the frame.

source: 拖动或缩放背景图，保留框中的部分。
en_us: Drag or zoom the background image, keeping the part within the frame.

source: 拖动裁切后的背景会在保存资料后生效。
en_us: Dragging the cropped background will take effect after saving the profile.

source: 按场景估算
en_us: Estimate by scenario

source: 按评论和点赞互动热度排序
en_us: Sort by interaction heat from comments and likes

source: 换一组
en_us: Change the set

source: 换个关键词试试。
en_us: Try another keyword.

source: 换个分类或关键词试试。
en_us: Try another category or keyword.

source: 排名 %d 条
en_us: Rank %d items

source: 排名分析
en_us: Ranking analysis

source: 排名失败：%@
en_us: Rankings failed: %@

source: 排名未开放
en_us: Ranking is not open

source: 排名趋势
en_us: Ranking trend

source: 排序
en_us: Sort

source: 接受后你可以查看对方发布的课程安排。对方可随时撤销查看权限。
en_us: After acceptance, you can view the course schedule published by the other party. The other party can revoke the viewing permission at any time.

source: 接受邀请并打开对方的共享课表
en_us: Accept the invitation and open the other person’s shared class schedule

source: 推送
en_us: Reminders

source: 推送时间
en_us: Notification Time

source: 提交
en_us: submit

source: 提交中
en_us: Submitting

source: 提交后需后台审核。审核前投票会继续公开展示。
en_us: Submission requires backend review. Votes will continue to be publicly displayed before review.

source: 提交后需要管理员审核。审核通过前，你仍留在当前学校社区。
en_us: Submission requires administrator review. You will remain in the current school community before approval.

source: 提交失败
en_us: Submission failed

source: 提交建议
en_us: Submit suggestion

source: 提交新菜名前，建议先在评菜页搜索菜名并切换地点确认是否已经有人提交过。
en_us: Before submitting a new dish name, it is recommended to first search the dish name on the dish review page and switch locations to confirm whether someone has already submitted it.

source: 提交更换学校申请？
en_us: Submit a school change request?

source: 提交更换申请
en_us: Submit Change Request

source: 提交申请
en_us: Submit application

source: 提交评分
en_us: Submit rating

source: 提前 %arg 分钟
en_us: %arg minutes in advance

source: 提前 %d 分钟
en_us: Early by %d minutes

source: 提前 %lld 分钟
en_us: %lld minutes ahead

source: 提示
en_us: Tip

source: 提醒只保存在本机，会为这门课尚未开始的周次创建本地通知。
en_us: Reminders are only saved locally and will create local notifications for the weeks of this course that have not yet started.

source: 提醒已设置。
en_us: Reminder has been set.

source: 提醒时间
en_us: Reminder time

source: 提醒星期
en_us: Reminder day of the week

source: 提醒来源
en_us: Reminder source

source: 提醒锚点
en_us: Reminder anchor

source: 插入
en_us: Insert

source: 插入已有内容
en_us: Insert existing content

source: 搜索帖子
en_us: Search posts

source: 搜索教师或学院
en_us: Search teachers or colleges

source: 搜索社区帖子
en_us: Search community posts

source: 搜索菜名或地点
en_us: Search dish names or locations

source: 搜索课程或单位
en_us: Search courses or units

source: 搜索随记
en_us: Search notes

source: 撤销
en_us: Undo

source: 撤销今日打卡
en_us: Cancel today’s check-in

source: 撤销所有同学的查看权限，并让已生成的邀请码失效
en_us: Revoke viewing permissions for all classmates and invalidate already generated invitation codes

source: 播放录音
en_us: Play recording

source: 操作失败
en_us: Operation failed

source: 操作成功
en_us: Operation successful

source: 收藏
en_us: Favorite

source: 收藏 %@
en_us: Collection %@

source: 收藏前需要先完善社区资料。
en_us: You need to complete your community profile before favoriting.

source: 收费标准
en_us: Pricing standards

source: 收起筛选
en_us: Close filters

source: 放大编辑器
en_us: Zoom editor

source: 放弃
en_us: Cancel

source: 放弃更改
en_us: Discard changes

source: 放弃未保存的更改
en_us: Discard unsaved changes

source: 放弃未保存的更改？
en_us: Discard unsaved changes?

source: 政策查询
en_us: Policy inquiry

source: 教务暂未开放成绩排名，或需要连接校园网后重新登录查询。
en_us: Academic affairs has not opened grade ranking yet, or you need to reconnect to the campus network and log in again to check.

source: 教务暂未开放成绩排名。
en_us: Academic affairs has not opened grade ranking.

source: 教务系统只能在校园网内访问。请连接 bjfu-wifi 后再更新；已缓存的数据仍可离线查看。
en_us: The academic affairs system can only be accessed on the campus network. Please connect to bjfu-wifi before updating; cached data can still be viewed offline.

source: 教务缓存已清除，本地数据与登录状态已保留。
en_us: Academic affairs cache has been cleared, local data and login status have been retained.

source: 教务缓存已清除。
en_us: Academic affairs cache has been cleared.

source: 教务返回的课表学期为 %@，与当前配置 %@ 不一致。请稍后重试。
en_us: The timetable returned by the Academic Affairs Office is for semester %@, which is inconsistent with the current configuration %@. Please try again later.

source: 教学楼
en_us: Teaching building

source: 教学计划
en_us: Teaching plan

source: 教学计划 %d 学期
en_us: Teaching plan %d semester

source: 教学计划失败
en_us: Teaching plan failed

source: 教学计划失败：%@
en_us: Teaching plan failed: %@

source: 教学计划已更新
en_us: Teaching plan updated

source: 教学计划页面返回了登录页。
en_us: The teaching plan page returned the login page.

source: 教室
en_us: Classroom

source: 教师
en_us: Teacher

source: 教师：%@
en_us: Teacher: %@

source: 数据来源：%@
en_us: Data source: %@

source: 数据来源：%arg
en_us: Data source: %arg

source: 数据结构
en_us: data structure

source: 文件
en_us: File

source: 文件会保存到本机学习空间，不会上传到云端。
en_us: Files will be saved to the local learning space and will not be uploaded to the cloud.

source: 文件本体保存在本机私有目录，仅当前 App 可访问。
en_us: The actual file is stored in the local private directory, accessible only by the current App.

source: 斜体
en_us: Italic

source: 新增台账
en_us: Add ledger

source: 新建学习空间
en_us: Create a new learning space

source: 新建考研目标
en_us: Create new postgraduate entrance examination objectives

source: 新的荣誉记录
en_us: New honor record

source: 方向
en_us: Direction

source: 无
en_us: None

source: 无标题
en_us: Untitled

source: 无标题草稿
en_us: Untitled draft

source: 无法保存录音
en_us: Unable to save recording

source: 无法保存随记
en_us: Unable to save note

source: 无法导入学习资料
en_us: Unable to import learning materials

source: 无法导出
en_us: Unable to export

source: 无法打开邮箱 App
en_us: Unable to open email App

source: 无法找到暂存文件 %@，请重新导入。
en_us: Unable to find temporary file %@, please re-import.

source: 无法找到本地学习资料文件。
en_us: Unable to find local study material files.

source: 无法找到本地荣誉文件。
en_us: Unable to find local honor files.

source: 无法拍照
en_us: Unable to take photo

source: 无法生成分享图片
en_us: Unable to generate share image

source: 无法生成图片
en_us: Unable to generate image

source: 无法访问 MyLeafy 共享暂存目录。
en_us: Unable to access MyLeafy shared temporary directory.

source: 无法读取这张图片，请换一张头像。
en_us: Unable to read this picture, please choose another avatar.

source: 无法读取这张图片，请换一张底图。
en_us: Unable to read this picture, please choose another base image.

source: 无法读取这张图片，请换一张背景图。
en_us: Unable to read this picture, please choose another background image.

source: 无法预览文件
en_us: Unable to preview file

source: 日期
en_us: Date

source: 日期偏移
en_us: date offset

source: 日程
en_us: Schedule

source: 日程信息
en_us: Schedule information

source: 日程只保存在本机。开启提醒后，会按所选开始时间创建本地通知。
en_us: Schedules are only saved locally. After enabling reminders, local notifications will be created according to the selected start time.

source: 日程已保存，但提醒未创建：%@
en_us: Schedule saved, but reminder not created: %@

source: 日程已删除。
en_us: Schedule deleted.

source: 日程时间
en_us: Schedule time

source: 日程视图
en_us: Schedule view

source: 日迹
en_us: Journal

source: 日迹操作
en_us: Daytrace actions

source: 旧缓存已备份到 %@。
en_us: Old cache has been backed up to %@.

source: 时间
en_us: Time

source: 时间：%@ %@-%@
en_us: Time: %@ %@-%@

source: 时间段
en_us: time period

source: 时间段分布
en_us: Time slot distribution

source: 时间段分布：%@
en_us: Time period distribution: %@

source: 时间视图
en_us: Time view

source: 明天没有课程
en_us: No classes tomorrow

source: 明日课表
en_us: Tomorrow's timetable

source: 星期
en_us: Week

source: 星期分布
en_us: Week distribution

source: 星期分布：%@
en_us: Weekday distribution: %@

source: 昨天 %@
en_us: Yesterday, %@

source: 是
en_us: Yes

source: 是否存入草稿箱？
en_us: Save to drafts?

source: 昵称
en_us: Nickname

source: 显示最新内容并回到顶部
en_us: Show the latest content and return to the top

source: 显示周末
en_us: Show weekends

source: 显示密码
en_us: Show Password

source: 显示当前时间线
en_us: Show current timeline

source: 显示方式
en_us: Display Mode

source: 晚间
en_us: Evening

source: 晴天
en_us: Clear

source: 暂不支持导入 %@。请使用 PDF、图片、Word 或 PPT 文件。
en_us: Importing %@ is not supported yet. Please use PDF, image, Word, or PPT files.

source: 暂停录音
en_us: Pause recording

source: 暂无专注记录
en_us: No focus records yet

source: 暂无任务
en_us: No tasks yet

source: 暂无公开帖子
en_us: No public posts yet

source: 暂无可分析的官方排名。
en_us: No official ranking available for analysis.

source: 暂无可用周末建议
en_us: No available weekend suggestions

source: 暂无可用的自定日程
en_us: No available custom schedules

source: 暂无同步记录
en_us: No synchronization records

source: 暂无培养方案
en_us: No training plans

source: 暂无培养方案缓存。连接校园网同步后，将按公选课、专选课和其他类别显示毕业要求。
en_us: No cached training plans. After connecting to the campus network to sync, graduation requirements will be displayed by elective courses, required courses, and other categories.

source: 暂无学习资料
en_us: No study materials

source: 暂无导入入口
en_us: No import entrance yet

source: 暂无已发布帖子
en_us: No published posts

source: 暂无已发起投票
en_us: No initiated votes

source: 暂无已配置假期
en_us: No configured holidays

source: 暂无成绩缓存
en_us: No cached grades

source: 暂无投票
en_us: No votes

source: 暂无投票记录
en_us: No voting records

source: 暂无拥挤度数据
en_us: No crowd level data

source: 暂无收藏
en_us: No favorites

source: 暂无收藏记录
en_us: No favorites records

source: 暂无教务考试
en_us: No academic exams

source: 暂无教学计划
en_us: No teaching plans

source: 暂无校历节点
en_us: No school calendar nodes

source: 暂无校园热力图
en_us: No campus heatmap

source: 暂无楼层数据
en_us: No floor data

source: 暂无正文
en_us: No content

source: 暂无点赞记录
en_us: No likes records

source: 暂无热力图数据
en_us: No heatmap data

source: 暂无热门帖子
en_us: No popular posts

source: 暂无空教室数据
en_us: No empty classroom data

source: 暂无考试安排
en_us: No exam schedule

source: 暂无自定义提醒
en_us: No custom reminders

source: 暂无自定日程
en_us: No custom schedules

source: 暂无草稿
en_us: No drafts

source: 暂无荣誉记录
en_us: No honor records

source: 暂无评论
en_us: No comments

source: 暂无评论。
en_us: No comments.

source: 暂无课程
en_us: No courses

source: 暂无课程进度
en_us: No course progress

source: 暂无课表
en_us: No timetable

source: 暂无课表缓存
en_us: No timetable cache

source: 暂无逐小时预报
en_us: No hourly forecast

source: 暂时无法访问教务系统。请连接 bjfu-wifi 或北林 VPN 后，再次点击同步或刷新。
en_us: The academic system is unavailable. Connect to bjfu-wifi or BJFU VPN, then tap sync or refresh again.

source: 暂时无法连接教务系统。请连接 bjfu-wifi 或北林 VPN 后，点击验证码区域重试。
en_us: The academic system is unavailable. Connect to bjfu-wifi or BJFU VPN, then tap the verification image to retry.

source: 暂时没有其他可更换的学校社区。
en_us: There are no other school communities available to switch to.

source: 暂时没有可直接加入的学校社区，你仍可以申请新增学校。
en_us: There are no school communities available to join directly. You can still request a new school.

source: 暂未找到 App Store 评分页面，请稍后再试。
en_us: App Store rating page not found, please try again later.

source: 暂未找到 App Store 页面，请稍后再试。
en_us: App Store page not found, please try again later.

source: 暑假
en_us: Summer Break

source: 更多学习空间操作
en_us: More study space actions

source: 更多学习资料操作
en_us: More learning material actions

source: 更多操作
en_us: More actions

source: 更多简历操作
en_us: More resume actions

source: 更多荣誉记录操作
en_us: More honor record actions

source: 更换学校社区
en_us: Switch school community

source: 更新所选日期和节次的校园热力图数据
en_us: Update campus heatmap data for the selected date and period

source: 更新数据
en_us: Update data

source: 更新时会优先复用当前教务登录状态，失效后再进行验证。
en_us: Your current academic system session is reused when possible. Verification is requested only after it expires.

source: 更新校园热力图
en_us: Update campus heatmap

source: 更新评分
en_us: Update rating

source: 替换
en_us: Replace

source: 月份
en_us: month

source: 有 %arg 间教室未匹配到当前教学楼目录，已排除在占用率之外。
en_us: Some %arg classrooms have not been matched to the current teaching building directory and have been excluded from occupancy rates.

source: 有 %d 门未通过课程需要处理
en_us: There are courses not passed in %d that need to be handled

source: 有 %lld 间教室未匹配到当前教学楼目录，已排除在占用率之外。
en_us: There are %lld classrooms that are not matched to the current teaching building directory and have been excluded from the occupancy rate.

source: 有同学发起新投票后会显示在这里。
en_us: New votes initiated by students will appear here.

source: 有效记录 %arg 次；目标按当前规则封顶展示。
en_us: Valid records %arg times; the target is capped according to current rules.

source: 有效记录 %lld 次；目标按当前规则封顶展示。
en_us: Effectively recorded %lld times; the target is capped and displayed according to the current rules.

source: 有新内容
en_us: New content available

source: 有记录的月份
en_us: Months with records

source: 未分类
en_us: Uncategorized

source: 未发现可备份的旧缓存文件。
en_us: No old cache files available for backup.

source: 未命名文章
en_us: Untitled article

source: 未命名课程
en_us: Untitled course

source: 未填写
en_us: Not filled

source: 未填写教师
en_us: Teacher not filled

source: 未找到反馈图片
en_us: Feedback image not found

source: 未找到课表查询参数，服务端页面结构可能已变更。%@
en_us: Timetable query parameters not found, server page structure may have changed. %@

source: 未来 12 小时
en_us: Next 12 hours

source: 未来 12 小时气温趋势
en_us: Temperature trend in the next 12 hours

source: 未来 12 小时降水概率
en_us: Precipitation probability in the next 12 hours

source: 未来 24 小时
en_us: Next 24 hours

source: 未来 24 小时：最高 %@，最低 %@
en_us: Next 24 hours: high %@, low %@

source: 未来 24 小时体感温度趋势
en_us: Feels-like temperature trend over the next 24 hours

source: 未来 24 小时最高 %@
en_us: Highest in the next 24 hours: %@

source: 未来 24 小时降水概率
en_us: Precipitation probability over the next 24 hours

source: 未知
en_us: Unknown

source: 未绑定
en_us: Not bound

source: 未缓存
en_us: Not cached

source: 未获取
en_us: Not retrieved

source: 未获取官方值
en_us: Official value not retrieved

source: 未获得完整日历访问权限，无法覆盖更新已导出的课表。请在系统设置中允许 %@ 访问日历。
en_us: Full calendar access not obtained, unable to overwrite and update exported timetable. Please allow %@ to access the calendar in system settings.

source: 未获得通知权限，请在系统设置中允许 %@ 发送通知。
en_us: Notification permission not obtained, please allow %@ to send notifications in system settings.

source: 未解析到任何成绩数据
en_us: No grade data parsed

source: 未设置时使用内置默认背景，也可以选择照片后裁切。
en_us: When not set, the built-in default background is used. You can also choose a photo and crop it.

source: 未读
en_us: Unread

source: 未读通知加载超时。
en_us: Loading unread notifications timed out.

source: 未选择
en_us: Not selected

source: 未通过
en_us: Not approved

source: 本周
en_us: This week

source: 本周位于本月第 %d 周
en_us: This week is the %d week of the month

source: 本周视图
en_us: Week view

source: 本周范围 %@
en_us: This week's range: %@

source: 本地学校账号
en_us: Local school account

source: 本地安全保存
en_us: Local secure storage

source: 本地政策
en_us: Local policy

source: 本地缓存和本地身份已清除。
en_us: Local cache and local identity have been cleared.

source: 本地缓存已恢复
en_us: Local cache restored

source: 本地缓存已清除。
en_us: Local cache cleared.

source: 本地缓存暂时无法重建，已使用临时空缓存启动。%@ 原始错误：%@
en_us: Local cache cannot be rebuilt temporarily. A temporary empty cache was used to start. %@ Original error: %@

source: 本地课表和成绩缓存无法直接打开，已自动重建缓存。%@
en_us: Local timetable and grade cache cannot be opened directly, cache has been automatically rebuilt. %@

source: 本地身份已识别，但刷新成绩需要连接校园网并重新建立教务登录态。
en_us: Local identity recognized, but refreshing grades requires connecting to the campus network and re-establishing the academic login state.

source: 本地身份已识别，但刷新课表需要连接校园网并重新建立教务登录态。
en_us: Local identity recognized, but refreshing timetable requires connecting to the campus network and re-establishing the academic login state.

source: 本地通知：提前 %d 分钟
en_us: Local notification: %d minutes in advance

source: 本年记录天数
en_us: Recording days this year

source: 本年随记
en_us: Notes this year

source: 本手册说明 %@ 的主要入口、课表学年范围、日迹用法、教务同步、数据边界和常见问题处理方式。
en_us: This manual explains the main entrance of %@, the academic year range of the class schedule, diary usage, academic synchronization, data boundaries and how to handle common problems.

source: 本手册说明 %arg 的主要入口、课表学年范围、日迹用法、教务同步、数据边界和常见问题处理方式。
en_us: This manual explains the main entry of %arg, timetable academic year range, daily usage, academic affairs synchronization, data boundaries, and common problem handling methods.

source: 本次未查询到官方排名。
en_us: No official ranking found this time.

source: 本次未查询到新的官方排名，已保留最近一次成功数据。
en_us: No new official ranking found this time, the most recent successful data has been retained.

# 本组 %arg / %arg 次
source: 本组 %1$arg / %2$arg 次
en_us: This group %arg / %arg times

# 本组 %lld / %lld 次
source: 本组 %1$lld / %2$lld 次
en_us: This group %lld / %lld times

# 本组已跑 %arg 次，目标 %arg 次。
source: 本组已跑 %1$arg 次，目标 %2$arg 次。
en_us: This group has run %arg times, target %arg times.

# 本组已跑 %lld 次，目标 %lld 次。
source: 本组已跑 %1$lld 次，目标 %2$lld 次。
en_us: This group has run %lld times and has a target of %lld times.

source: 材料
en_us: Materials

source: 材料已保存到本机。
en_us: The material has been saved to this device.

source: 材料已准备
en_us: Materials ready

source: 来源
en_us: Source

# 来源：%@。政策更新于 %@，校医院基础信息更新于 %@。
source: 来源：%1$@。政策更新于 %2$@，校医院基础信息更新于 %3$@。
en_us: Source: %@. The policy is updated in %@, and the basic information of the school hospital is updated in %@.

# 来源：%arg。政策更新于 %arg，校医院基础信息更新于 %arg。
source: 来源：%1$arg。政策更新于 %2$arg，校医院基础信息更新于 %3$arg。
en_us: Source: %arg. Policy updated on %arg, campus hospital basic information updated on %arg.

source: 来自 %@
en_us: From %@

source: 来自成绩页
en_us: From the grade page

source: 查看分析
en_us: View analysis

source: 查看原链接
en_us: View original link

source: 查看学校官方 VPN 使用指南
en_us: View the official school VPN usage guide

source: 查看当前教学楼拥挤度
en_us: See how busy teaching buildings are.

source: 查看成绩分析详情
en_us: View detailed grade analysis

source: 查看权限已撤销。
en_us: View permission has been revoked.

source: 查看详情
en_us: View details

source: 查看课表
en_us: View schedule

source: 查询完成
en_us: Query complete

source: 查询教室
en_us: Query classrooms

source: 查询方式
en_us: Query method

source: 查询缓存
en_us: Query cache

source: 标准
en_us: Standard

source: 标准分 %@
en_us: Standard score %@

source: 标准分 %arg
en_us: Standard score %arg

source: 标签
en_us: Tags

source: 标记为完成
en_us: Mark as complete

source: 标记为未完成
en_us: Mark as incomplete

source: 标记聚焦
en_us: Tag spotlight

source: 标题
en_us: Title

source: 校历
en_us: Academic calendar

source: 校历更新后显示
en_us: Display after updating school calendar

source: 校园
en_us: Campus

source: 校园服务
en_us: Campus services

source: 校园热力图
en_us: Campus Heatmap

source: 校园网连接说明
en_us: Campus network connection instructions
